deanm1278/ArduinoCore-blackfin/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA


feather_bfin.name=Feather Blackfin
feather_bfin.vid.0=0x239A
feather_bfin.pid.0=0x8013
feather_bfin.vid.1=0x239A
feather_bfin.pid.1=0x0013
feather_bfin.upload.tool=bossac
feather_bfin.upload.protocol=sam-ba
feather_bfin.upload.offset=0x2000
feather_bfin.upload.maximum_size=16777216
feather_bfin.upload.use_1200bps_touch=true
feather_bfin.upload.wait_for_upload_port=true
feather_bfin.upload.native_usb=true
feather_bfin.build.mcu=bf706
feather_bfin.build.f_cpu=48000000L
feather_bfin.build.usb_product="Feather Blackfin"
feather_bfin.build.usb_manufacturer="Adafruit"
feather_bfin.build.board=FEATHER_BFIN
feather_bfin.build.core=arduino
feather_bfin.build.extra_flags=-DARDUINO_BFIN -D__BF70x__
feather_bfin.build.ldscript=linker_scripts/gcc/link-bf706.ld
feather_bfin.build.openocdscript=openocd_scripts/bf706-ez-loader.cfg
feather_bfin.build.variant=feather_bfin
feather_bfin.build.variant_system_lib=
feather_bfin.build.vid=0x239A
feather_bfin.build.pid=0x8013

dsp_pedal.name=DSP Pedal
dsp_pedal.vid.0=0x239A
dsp_pedal.pid.0=0x8013
dsp_pedal.vid.1=0x239A
dsp_pedal.pid.1=0x0013
dsp_pedal.upload.tool=bossac
dsp_pedal.upload.protocol=sam-ba
dsp_pedal.upload.offset=0x2000
dsp_pedal.upload.maximum_size=16777216
dsp_pedal.upload.use_1200bps_touch=true
dsp_pedal.upload.wait_for_upload_port=true
dsp_pedal.upload.native_usb=true
dsp_pedal.build.mcu=bf706
dsp_pedal.build.f_cpu=48000000L
dsp_pedal.build.usb_product="DSP Pedal"
dsp_pedal.build.usb_manufacturer="Adafruit"
dsp_pedal.build.board=DSP_PEDAL
dsp_pedal.build.core=arduino
dsp_pedal.build.extra_flags=-DARDUINO_BFIN -D__BF70x__
dsp_pedal.build.ldscript=linker_scripts/gcc/link-bf706.ld
dsp_pedal.build.openocdscript=openocd_scripts/bf706-ez-loader.cfg
dsp_pedal.build.variant=fx_pedal
dsp_pedal.build.variant_system_lib=
dsp_pedal.build.vid=0x239A
dsp_pedal.build.pid=0x8013

dsp_uno.name=DSP Uno
dsp_uno.vid.0=0x239A
dsp_uno.pid.0=0x8013
dsp_uno.vid.1=0x239A
dsp_uno.pid.1=0x0013
dsp_uno.upload.tool=bossac
dsp_uno.upload.protocol=sam-ba
dsp_uno.upload.offset=0x2000
dsp_uno.upload.maximum_size=16777216
dsp_uno.upload.use_1200bps_touch=true
dsp_uno.upload.wait_for_upload_port=true
dsp_uno.upload.native_usb=true
dsp_uno.build.mcu=bf706
dsp_uno.build.f_cpu=48000000L
dsp_uno.build.usb_product="DSP Uno"
dsp_uno.build.usb_manufacturer="Adafruit"
dsp_uno.build.board=DSP_UNO
dsp_uno.build.core=arduino
dsp_uno.build.extra_flags=-DARDUINO_BFIN -D__BF70x__
dsp_uno.build.ldscript=linker_scripts/gcc/link-bf706.ld
dsp_uno.build.openocdscript=openocd_scripts/bf706-ez-loader.cfg
dsp_uno.build.variant=dsp_uno
dsp_uno.build.variant_system_lib=
dsp_uno.build.vid=0x239A
dsp_uno.build.pid=0x8013

#bf706_ez_kit.name=BF706 ez-kit
#bf706_ez_kit.upload.tool=openocd
#bf706_ez_kit.upload.protocol=sam-ba
#bf706_ez_kit.upload.maximum_size=69632
#bf706_ez_kit.upload.use_1200bps_touch=false
#bf706_ez_kit.upload.wait_for_upload_port=false
#bf706_ez_kit.upload.native_usb=false
#bf706_ez_kit.build.mcu=bf706
#bf706_ez_kit.build.f_cpu=48000000L
#bf706_ez_kit.build.usb_product="BF706 ez-kit"
#bf706_ez_kit.build.usb_manufacturer="Dean"
#bf706_ez_kit.build.board=EZ_KIT
#bf706_ez_kit.build.core=arduino
#bf706_ez_kit.build.extra_flags=-DARDUINO_BFIN -D__BF70x__
#bf706_ez_kit.build.ldscript=linker_scripts/gcc/link-bf706.ld
#bf706_ez_kit.build.openocdscript=openocd_scripts/bf706-ez-loader.cfg
#bf706_ez_kit.build.variant=bf706_ez_kit
#bf706_ez_kit.build.variant_system_lib=
#bf706_ez_kit.build.vid=0x064b
#bf706_ez_kit.build.pid=0x0586
#bf706_ez_kit.bootloader.tool=openocd
#bf706_ez_kit.bootloader.file=bf706-ez-kit/bootloader.bin

bf706_ez_kit_ram.name=BF706 ez-kit RAM
bf706_ez_kit_ram.upload.tool=openocd-ram
bf706_ez_kit_ram.upload.protocol=sam-ba
bf706_ez_kit_ram.upload.maximum_size=69632
bf706_ez_kit_ram.upload.use_1200bps_touch=false
bf706_ez_kit_ram.upload.wait_for_upload_port=false
bf706_ez_kit_ram.upload.native_usb=false
bf706_ez_kit_ram.build.mcu=bf706
bf706_ez_kit_ram.build.f_cpu=48000000L
bf706_ez_kit_ram.build.usb_product="BF706 ez-kit"
bf706_ez_kit_ram.build.usb_manufacturer="Dean"
bf706_ez_kit_ram.build.board=EZ_KIT
bf706_ez_kit_ram.build.core=arduino
bf706_ez_kit_ram.build.extra_flags=-DARDUINO_BFIN -D__BF70x__
bf706_ez_kit_ram.build.ldscript=linker_scripts/gcc/link-bf706.ld
bf706_ez_kit_ram.build.openocdscript=openocd_scripts/bf706-ez-kit.cfg
bf706_ez_kit_ram.build.variant=bf706_ez_kit
bf706_ez_kit_ram.build.variant_system_lib=
bf706_ez_kit_ram.build.vid=0x064b
bf706_ez_kit_ram.build.pid=0x0586
bf706_ez_kit_ram.bootloader.tool=openocd
bf706_ez_kit_ram.bootloader.file=bf706-ez-kit/bootloader.bin

